; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v1 ?v6)
             (pred_11 ?v9 ?v11)
             (pred_8 ?v1 ?v11)
             (pred_2 ?v13 ?v1 )
	     (pred_5 ?v1)
             (pred_10 ?v8)
             (pred_4 ?v9)
             (pred_12 ?v11)
             (pred_9 ?v1)
             (pred_6 ?v9)
             (pred_7 ?v1)
             (pred_3 ))



(:action op_2
:parameters (?v4 ?v12 ?v3 ?v5)
:precondition (and (pred_10 ?v4) (pred_10 ?v12) (pred_4 ?v3) (pred_12 ?v5)
          (pred_1 ?v4 ?v12) (pred_11 ?v3 ?v5)
                   (pred_8 ?v12 ?v5) (pred_5 ?v4) 
                   (pred_9 ?v12) (pred_6 ?v3))
:effect (and  (pred_7 ?v12) (not (pred_9 ?v12))))


(:action op_1
:parameters (?v4 ?v7)
:precondition (and (pred_10 ?v4) (pred_10 ?v7)
               (pred_5 ?v4) (pred_1 ?v4 ?v7) (pred_7 ?v7))
:effect (and (pred_5 ?v7) (not (pred_5 ?v4))))

(:action op_5
:parameters (?v4 ?v3)
:precondition (and (pred_10 ?v4) (pred_4 ?v3) 
                  (pred_5 ?v4) (pred_2 ?v3 ?v4) (pred_3 ))
:effect (and (pred_6 ?v3)
   (not (pred_2 ?v3 ?v4)) (not (pred_3 ))))


(:action op_4
:parameters (?v4 ?v10 ?v2)
:precondition (and (pred_10 ?v4) (pred_4 ?v10) (pred_4 ?v2)
                  (pred_5 ?v4) (pred_6 ?v2) (pred_2 ?v10 ?v4))
:effect (and (pred_6 ?v10) (pred_2 ?v2 ?v4)
        (not (pred_6 ?v2)) (not (pred_2 ?v10 ?v4))))

(:action op_3
:parameters (?v4 ?v3)
:precondition (and (pred_10 ?v4) (pred_4 ?v3) 
                  (pred_5 ?v4) (pred_6 ?v3))
:effect (and (pred_3 ) (pred_2 ?v3 ?v4) (not (pred_6 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_07 obj_04 obj_02 obj_20 obj_05 obj_01 obj_11 obj_15 obj_12 obj_17 obj_03 obj_08 obj_14 obj_18 obj_13 obj_10
    obj_19 obj_16
    obj_09 obj_06
    )

    (:init
       (pred_3)

       (pred_10 obj_07)
       (pred_10 obj_04)
       (pred_10 obj_02)
       (pred_10 obj_20)
       (pred_10 obj_05)
       (pred_10 obj_01)
       (pred_10 obj_11)
       (pred_10 obj_15)
       (pred_10 obj_12)
       (pred_10 obj_17)
       (pred_10 obj_03)
       (pred_10 obj_08)
       (pred_10 obj_14)
       (pred_10 obj_18)
       (pred_10 obj_13)
       (pred_10 obj_10)
       (pred_12 obj_19)
       (pred_12 obj_16)
       (pred_4 obj_09)
       (pred_4 obj_06)

       (pred_1 obj_07 obj_05)
       (pred_1 obj_07 obj_04)
       (pred_1 obj_04 obj_01)
       (pred_1 obj_04 obj_02)
       (pred_1 obj_04 obj_07)
       (pred_1 obj_02 obj_11)
       (pred_1 obj_02 obj_20)
       (pred_1 obj_02 obj_04)
       (pred_1 obj_20 obj_15)
       (pred_1 obj_20 obj_02)
       (pred_1 obj_05 obj_12)
       (pred_1 obj_05 obj_01)
       (pred_1 obj_05 obj_07)
       (pred_1 obj_01 obj_17)
       (pred_1 obj_01 obj_11)
       (pred_1 obj_01 obj_04)
       (pred_1 obj_01 obj_05)
       (pred_1 obj_11 obj_03)
       (pred_1 obj_11 obj_15)
       (pred_1 obj_11 obj_02)
       (pred_1 obj_11 obj_01)
       (pred_1 obj_15 obj_08)
       (pred_1 obj_15 obj_20)
       (pred_1 obj_15 obj_11)
       (pred_1 obj_12 obj_14)
       (pred_1 obj_12 obj_17)
       (pred_1 obj_12 obj_05)
       (pred_1 obj_17 obj_18)
       (pred_1 obj_17 obj_03)
       (pred_1 obj_17 obj_01)
       (pred_1 obj_17 obj_12)
       (pred_1 obj_03 obj_13)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_03 obj_11)
       (pred_1 obj_03 obj_17)
       (pred_1 obj_08 obj_10)
       (pred_1 obj_08 obj_15)
       (pred_1 obj_08 obj_03)
       (pred_1 obj_14 obj_18)
       (pred_1 obj_14 obj_12)
       (pred_1 obj_18 obj_13)
       (pred_1 obj_18 obj_17)
       (pred_1 obj_18 obj_14)
       (pred_1 obj_13 obj_10)
       (pred_1 obj_13 obj_03)
       (pred_1 obj_13 obj_18)
       (pred_1 obj_10 obj_08)
       (pred_1 obj_10 obj_13)
       (pred_9 obj_14)
       (pred_9 obj_01)
       (pred_8  obj_14 obj_19)
       (pred_8  obj_01 obj_16)
       (pred_7 obj_07)
       (pred_7 obj_04)
       (pred_7 obj_02)
       (pred_7 obj_20)
       (pred_7 obj_05)
       (pred_7 obj_11)
       (pred_7 obj_15)
       (pred_7 obj_12)
       (pred_7 obj_17)
       (pred_7 obj_03)
       (pred_7 obj_08)
       (pred_7 obj_18)
       (pred_7 obj_13)
       (pred_7 obj_10)

       (pred_11  obj_09 obj_19)
       (pred_11  obj_06 obj_16)
       (pred_2 obj_09 obj_13)
       (pred_2 obj_06 obj_20)
       (pred_5 obj_15)
    )

    (:goal (and
       (pred_2 obj_06 obj_03)
    ))
(:constraints
  (always (not (pred_5 obj_11)))
)
)

; plan
1. (op_1 obj_15 obj_20)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_20)
   goals met: 0 of 1
2. (op_5 obj_20 obj_06)
   deleted: (pred_2 obj_06 obj_20) (pred_3)
   added: (pred_6 obj_06)
   goals met: 0 of 1
3. (op_1 obj_20 obj_15)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_15)
   goals met: 0 of 1
4. (op_1 obj_15 obj_08)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_08)
   goals met: 0 of 1
5. (op_1 obj_08 obj_03)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_03)
   goals met: 0 of 1
6. (op_3 obj_03 obj_06)
   deleted: (pred_6 obj_06)
   added: (pred_3) (pred_2 obj_06 obj_03)
   goals met: 1 of 1
